import hongloumeng from './img/红楼梦.png'
import xiyouji from './img/西游记.png'

const data = [{
    name: '红楼梦',
    img: hongloumeng,
    intro: '红楼梦》是中国古代小说的巅峰之作，也是中国四大名著之一。全书以贾、史、王、薛四大家族的兴衰为背景，通过对人物命运的描述，展现了封建社会的残酷和虚伪。小说中涉及了丰富的人物形象和精彩的故事情节，既以宏大的篇章展示了封建社会的体制与伦理，又通过草木调和、笔墨凝聚出世界文学史上独一无二的文化艺术光辉。',
    router: '/Red'
}, {
    name: '西游记',
    img: xiyouji,
    intro: '《西游记》是中国古代第一部浪漫主义章回体长篇神魔小说。 今见最早的《西游记》版本是明代万历二十年金陵世德堂《新刻出像官板大字西游记》，未署作者姓名。 鲁迅、董作宾等人根据《淮安府志》“吴承恩《西游记》”的记载予以最终论定“吴承恩原著”。',
}]

export default data